In [1]:
import findspark
findspark.init()

from pyspark.sql import SparkSession
from pyspark.sql.functions import*

from pyspark.sql.types import StructType, StructField, StringType, IntegerType, BooleanType, DoubleType

import pandas as pd

In [2]:
spark = SparkSession.builder.master("local[*]").appName("Test SQL app").getOrCreate()

Creating a Spark DataFrame

In [3]:
df = spark.read.json("capstone_files\cdw_sapp_custmer.json")
df.printSchema()
df.show()

root
 |-- APT_NO: string (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: long (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: string (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: long (nullable = true)
 |-- STREET_NAME: string (nullable = true)

+------+----------------+------------+-------------+--------------------+----------+----------+--------+----------+---------+--------------------+-----------+---------+-----------------+
|APT_NO|  CREDIT_CARD_NO|   CUST_CITY| CUST_COUNTRY|          CUST_EMAIL|CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|        LAST_UPDATED|MIDDLE_NAME|      SSN|      STREET_NAME|
+------+----------------+------------+-------------+--------------------+----------+----------+--------+----------+---------+--------------------+-----------+---------+-----------------+
|   656|4210653310061055|     Natchez|United States| AHooper@example.com|   1237818|        MS|   39120|      Alec|   Hooper|2018-04-21T12:49:...|         Wm|123456100|Main Street North|
|   829|4210653310102868|Wethersfield|United States| EHolman@example.com|   1238933|        CT|   06109|      Etta|   Holman|2018-04-21T12:49:...|    Brendan|123453023|    Redwood Drive|
|   683|4210653310116272|     Huntley|United States| WDunham@example.com|   1243018|        IL|   60142|    Wilber|   Dunham|2018-04-21T12:49:...|   Ezequiel|123454487| 12th Street East|
|   253|4210653310195948|   NewBerlin|United States|  EHardy@example.com|   1243215|        WI|   53151|   Eugenio|    Hardy|2018-04-21T12:49:...|      Trina|123459758|Country Club Road|
|   301|4210653310356919|      ElPaso|United States|  WAyers@example.com|   1242074|        TX|   79930|   Wilfred|    Ayers|2018-04-21T12:49:...|        May|123454431|   Madison Street|
|     3|4210653310395982|NorthOlmsted|United States|BWoodard@example.com|   1242570|        OH|   44070|      Beau|  Woodard|2018-04-21T12:49:...|    Ambrose|123454202|   Colonial Drive|
|    84|4210653310400536|      Vienna|United States|   SKemp@example.com|   1239685|        VA|   22180|    Sheila|     Kemp|2018-04-21T12:49:...|      Larry|123451799|   Belmont Avenue|
|   728|4210653310459911|      Duarte|United States| WHurley@example.com|   1238213|        CA|   91010|     Wendy|   Hurley|2018-04-21T12:49:...|        Ora|123453875|     Oxford Court|
|    81|4210653310773972|      Owosso|United States|AGilmore@example.com|   1240689|        MI|   48867|      Alec|  Gilmore|2018-04-21T12:49:...|     Tracie|123457511|    Forest Street|
|   561|4210653310794854|        Zion|United States|    BLau@example.com|   1235222|        IL|   60099|    Barbra|      Lau|2018-04-21T12:49:...|    Mitchel|123457464|     Court Street|
|   622|4210653310817373|  Youngstown|United States|EThomson@example.com|   1241363|        OH|   44512|   Edmundo|  Thomson|2018-04-21T12:49:...|      Denny|123457639|    Cypress Court|
|   924|4210653310844617| Summerville|United States| ETruong@example.com|   1236228|        SC|   29483|      Elsa|   Truong|2018-04-21T12:49:...|   Isabelle|123453242|  8th Street West|
|   611|4210653311015303|      ElPaso|United States|HMckinney@example...|   1238165|        TX|   79930|     Homer| Mckinney|2018-04-21T12:49:...|      Henry|123454339|      East Avenue|
|   680|4210653311215039|      Fenton|United States|   RKidd@example.com|   1234730|        MI|   48430|      Rita|     Kidd|2018-04-21T12:49:...|     Rickey|123454537|         Route 44|
|    71|4210653311229354|  Grandville|United States|ABallard@example.com|   1242113|        MI|   49418|    Amalia|  Ballard|2018-04-21T12:49:...|  Heriberto|123452373|    Warren Street|
|   195|4210653311652836|    YubaCity|United States| PThomas@example.com|   1239888|        CA|   95993|     Patty|   Thomas|2018-04-21T12:49:...|   Angelita|123455343|     Jones Street|
|   500|4210653311707126|   CapeCoral|United States| JMorrow@example.com|   1240158|        FL|   33904|  Josefina|   Morrow|2018-04-21T12:49:...|   Dorothea|123451533|       New Street|
|   989|4210653311730764|  Brookfield|United States|NAndrews@example.com|   1241408|        WI|   53045|    Nelson|  Andrews|2018-04-21T12:49:...|  Jefferson|123459278|  Division Street|
|   810|4210653311898082|    Richmond|United States|MSchneider@exampl...|   1238390|        VA|   23223|    Miquel|Schneider|2018-04-21T12:49:...|     Maximo|123456915|     Maple Street|
|   649|4210653312021765| WestChester|United States|PTidwell@example.com|   1235067|        PA|   19380|    Parker|  Tidwell|2018-04-21T12:49:...|    Arnulfo|123453807|       Eagle Road|
+------+----------------+------------+-------------+--------------------+----------+----------+--------+----------+---------+--------------------+-----------+---------+-----------------+
only showing top 20 rows

Concatenate Apartment no and Street name of customer's Residence with comma as a seperator (Street, Apartment)

In [4]:
df_cust=df.toPandas() #converting spark datafram to pandas dataframe

In [5]:
df_cust.dtypes #checking data types

APT_NO            object
CREDIT_CARD_NO    object
CUST_CITY         object
CUST_COUNTRY      object
CUST_EMAIL        object
CUST_PHONE         int64
CUST_STATE        object
CUST_ZIP          object
FIRST_NAME        object
LAST_NAME         object
LAST_UPDATED      object
MIDDLE_NAME       object
SSN                int64
STREET_NAME       object
dtype: object

In [6]:
df_cust['CUST_ZIP']=df_cust['CUST_ZIP'].astype(int)

In [7]:
df_cust["FIRST_NAME"]=df_cust['FIRST_NAME'].str.title() #convert first name to title case
df_cust

,APT_NO,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,STREET_NAME
0,656,4210653310061055,Natchez,United States,AHooper@example.com,1237818,MS,39120,Alec,Hooper,2018-04-21T12:49:02.000-04:00,Wm,123456100,Main Street North
1,829,4210653310102868,Wethersfield,United States,EHolman@example.com,1238933,CT,6109,Etta,Holman,2018-04-21T12:49:02.000-04:00,Brendan,123453023,Redwood Drive
2,683,4210653310116272,Huntley,United States,WDunham@example.com,1243018,IL,60142,Wilber,Dunham,2018-04-21T12:49:02.000-04:00,Ezequiel,123454487,12th Street East
3,253,4210653310195948,NewBerlin,United States,EHardy@example.com,1243215,WI,53151,Eugenio,Hardy,2018-04-21T12:49:02.000-04:00,Trina,123459758,Country Club Road
4,301,4210653310356919,ElPaso,United States,WAyers@example.com,1242074,TX,79930,Wilfred,Ayers,2018-04-21T12:49:02.000-04:00,May,123454431,Madison Street
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,882,4210653399559239,SiouxCity,United States,FCastle@example.com,1238344,IA,51106,Freida,Castle,2018-04-21T12:49:02.000-04:00,Jonah,123451589,Main Street South
948,470,4210653399650358,Summerville,United States,FBlock@example.com,1240420,SC,29483,Fern,Block,2018-04-21T12:49:02.000-04:00,Aron,123457088,Glenwood Avenue
949,405,4210653399732638,Duluth,United States,DPruitt@example.com,1236149,GA,30096,Dylan,Pruitt,2018-04-21T12:49:02.000-04:00,Lucas,123453259,Country Lane
950,15,4210653399859149,Rowlett,United States,EBeatty@example.com,1236886,TX,75088,Emery,Beatty,2018-04-21T12:49:02.000-04:00,Susanna,123454047,8th Street
951,67,4210653399939240,SanLorenzo,United States,PMullen@example.com,1237017,CA,94580,Phil,Mullen,2018-04-21T12:49:02.000-04:00,Jaime,123454500,Charles Street

In [8]:
df_cust["MIDDLE_NAME"]=df_cust["MIDDLE_NAME"].str.lower() #convert middle name to lowercase
df_cust

,APT_NO,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,STREET_NAME
0,656,4210653310061055,Natchez,United States,AHooper@example.com,1237818,MS,39120,Alec,Hooper,2018-04-21T12:49:02.000-04:00,wm,123456100,Main Street North
1,829,4210653310102868,Wethersfield,United States,EHolman@example.com,1238933,CT,6109,Etta,Holman,2018-04-21T12:49:02.000-04:00,brendan,123453023,Redwood Drive
2,683,4210653310116272,Huntley,United States,WDunham@example.com,1243018,IL,60142,Wilber,Dunham,2018-04-21T12:49:02.000-04:00,ezequiel,123454487,12th Street East
3,253,4210653310195948,NewBerlin,United States,EHardy@example.com,1243215,WI,53151,Eugenio,Hardy,2018-04-21T12:49:02.000-04:00,trina,123459758,Country Club Road
4,301,4210653310356919,ElPaso,United States,WAyers@example.com,1242074,TX,79930,Wilfred,Ayers,2018-04-21T12:49:02.000-04:00,may,123454431,Madison Street
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,882,4210653399559239,SiouxCity,United States,FCastle@example.com,1238344,IA,51106,Freida,Castle,2018-04-21T12:49:02.000-04:00,jonah,123451589,Main Street South
948,470,4210653399650358,Summerville,United States,FBlock@example.com,1240420,SC,29483,Fern,Block,2018-04-21T12:49:02.000-04:00,aron,123457088,Glenwood Avenue
949,405,4210653399732638,Duluth,United States,DPruitt@example.com,1236149,GA,30096,Dylan,Pruitt,2018-04-21T12:49:02.000-04:00,lucas,123453259,Country Lane
950,15,4210653399859149,Rowlett,United States,EBeatty@example.com,1236886,TX,75088,Emery,Beatty,2018-04-21T12:49:02.000-04:00,susanna,123454047,8th Street
951,67,4210653399939240,SanLorenzo,United States,PMullen@example.com,1237017,CA,94580,Phil,Mullen,2018-04-21T12:49:02.000-04:00,jaime,123454500,Charles Street

In [9]:
df_cust["LAST_NAME"]=df_cust["LAST_NAME"].str.title() 
df_cust

,APT_NO,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,STREET_NAME
0,656,4210653310061055,Natchez,United States,AHooper@example.com,1237818,MS,39120,Alec,Hooper,2018-04-21T12:49:02.000-04:00,wm,123456100,Main Street North
1,829,4210653310102868,Wethersfield,United States,EHolman@example.com,1238933,CT,6109,Etta,Holman,2018-04-21T12:49:02.000-04:00,brendan,123453023,Redwood Drive
2,683,4210653310116272,Huntley,United States,WDunham@example.com,1243018,IL,60142,Wilber,Dunham,2018-04-21T12:49:02.000-04:00,ezequiel,123454487,12th Street East
3,253,4210653310195948,NewBerlin,United States,EHardy@example.com,1243215,WI,53151,Eugenio,Hardy,2018-04-21T12:49:02.000-04:00,trina,123459758,Country Club Road
4,301,4210653310356919,ElPaso,United States,WAyers@example.com,1242074,TX,79930,Wilfred,Ayers,2018-04-21T12:49:02.000-04:00,may,123454431,Madison Street
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,882,4210653399559239,SiouxCity,United States,FCastle@example.com,1238344,IA,51106,Freida,Castle,2018-04-21T12:49:02.000-04:00,jonah,123451589,Main Street South
948,470,4210653399650358,Summerville,United States,FBlock@example.com,1240420,SC,29483,Fern,Block,2018-04-21T12:49:02.000-04:00,aron,123457088,Glenwood Avenue
949,405,4210653399732638,Duluth,United States,DPruitt@example.com,1236149,GA,30096,Dylan,Pruitt,2018-04-21T12:49:02.000-04:00,lucas,123453259,Country Lane
950,15,4210653399859149,Rowlett,United States,EBeatty@example.com,1236886,TX,75088,Emery,Beatty,2018-04-21T12:49:02.000-04:00,susanna,123454047,8th Street
951,67,4210653399939240,SanLorenzo,United States,PMullen@example.com,1237017,CA,94580,Phil,Mullen,2018-04-21T12:49:02.000-04:00,jaime,123454500,Charles Street

In [10]:
df_cust['FULL_STREET_ADDRESS']=df_cust[['APT_NO','STREET_NAME']].apply(' , '.join, axis=1) #combine apt no and street name columns
df_cust

,APT_NO,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,STREET_NAME,FULL_STREET_ADDRESS
0,656,4210653310061055,Natchez,United States,AHooper@example.com,1237818,MS,39120,Alec,Hooper,2018-04-21T12:49:02.000-04:00,wm,123456100,Main Street North,"656 , Main Street North"
1,829,4210653310102868,Wethersfield,United States,EHolman@example.com,1238933,CT,6109,Etta,Holman,2018-04-21T12:49:02.000-04:00,brendan,123453023,Redwood Drive,"829 , Redwood Drive"
2,683,4210653310116272,Huntley,United States,WDunham@example.com,1243018,IL,60142,Wilber,Dunham,2018-04-21T12:49:02.000-04:00,ezequiel,123454487,12th Street East,"683 , 12th Street East"
3,253,4210653310195948,NewBerlin,United States,EHardy@example.com,1243215,WI,53151,Eugenio,Hardy,2018-04-21T12:49:02.000-04:00,trina,123459758,Country Club Road,"253 , Country Club Road"
4,301,4210653310356919,ElPaso,United States,WAyers@example.com,1242074,TX,79930,Wilfred,Ayers,2018-04-21T12:49:02.000-04:00,may,123454431,Madison Street,"301 , Madison Street"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,882,4210653399559239,SiouxCity,United States,FCastle@example.com,1238344,IA,51106,Freida,Castle,2018-04-21T12:49:02.000-04:00,jonah,123451589,Main Street South,"882 , Main Street South"
948,470,4210653399650358,Summerville,United States,FBlock@example.com,1240420,SC,29483,Fern,Block,2018-04-21T12:49:02.000-04:00,aron,123457088,Glenwood Avenue,"470 , Glenwood Avenue"
949,405,4210653399732638,Duluth,United States,DPruitt@example.com,1236149,GA,30096,Dylan,Pruitt,2018-04-21T12:49:02.000-04:00,lucas,123453259,Country Lane,"405 , Country Lane"
950,15,4210653399859149,Rowlett,United States,EBeatty@example.com,1236886,TX,75088,Emery,Beatty,2018-04-21T12:49:02.000-04:00,susanna,123454047,8th Street,"15 , 8th Street"
951,67,4210653399939240,SanLorenzo,United States,PMullen@example.com,1237017,CA,94580,Phil,Mullen,2018-04-21T12:49:02.000-04:00,jaime,123454500,Charles Street,"67 , Charles Street"

In [11]:
df_cust.drop(['STREET_NAME','APT_NO'], axis=1, inplace=True) #drop aptno and street name columns

In [12]:
#format phone number into (XXX)XXX-XXXX
#change data type from int to str
df_cust['CUST_PHONE']=df_cust['CUST_PHONE'].astype(str)

#[print (type(x)) for x in df_pandas['CUST_PHONE'].values]
first_three=df_cust['CUST_PHONE'].str[:3] #return first 3 digits
last_four=df_cust['CUST_PHONE'].str[3:] # return last four
for number in df_cust['CUST_PHONE']:
    df_cust['CUST_PHONE']='('+ '516'+ ')'+ first_three + '-' + last_four #change phont number format

df_cust

,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,FULL_STREET_ADDRESS
0,4210653310061055,Natchez,United States,AHooper@example.com,(516)123-7818,MS,39120,Alec,Hooper,2018-04-21T12:49:02.000-04:00,wm,123456100,"656 , Main Street North"
1,4210653310102868,Wethersfield,United States,EHolman@example.com,(516)123-8933,CT,6109,Etta,Holman,2018-04-21T12:49:02.000-04:00,brendan,123453023,"829 , Redwood Drive"
2,4210653310116272,Huntley,United States,WDunham@example.com,(516)124-3018,IL,60142,Wilber,Dunham,2018-04-21T12:49:02.000-04:00,ezequiel,123454487,"683 , 12th Street East"
3,4210653310195948,NewBerlin,United States,EHardy@example.com,(516)124-3215,WI,53151,Eugenio,Hardy,2018-04-21T12:49:02.000-04:00,trina,123459758,"253 , Country Club Road"
4,4210653310356919,ElPaso,United States,WAyers@example.com,(516)124-2074,TX,79930,Wilfred,Ayers,2018-04-21T12:49:02.000-04:00,may,123454431,"301 , Madison Street"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,4210653399559239,SiouxCity,United States,FCastle@example.com,(516)123-8344,IA,51106,Freida,Castle,2018-04-21T12:49:02.000-04:00,jonah,123451589,"882 , Main Street South"
948,4210653399650358,Summerville,United States,FBlock@example.com,(516)124-0420,SC,29483,Fern,Block,2018-04-21T12:49:02.000-04:00,aron,123457088,"470 , Glenwood Avenue"
949,4210653399732638,Duluth,United States,DPruitt@example.com,(516)123-6149,GA,30096,Dylan,Pruitt,2018-04-21T12:49:02.000-04:00,lucas,123453259,"405 , Country Lane"
950,4210653399859149,Rowlett,United States,EBeatty@example.com,(516)123-6886,TX,75088,Emery,Beatty,2018-04-21T12:49:02.000-04:00,susanna,123454047,"15 , 8th Street"
951,4210653399939240,SanLorenzo,United States,PMullen@example.com,(516)123-7017,CA,94580,Phil,Mullen,2018-04-21T12:49:02.000-04:00,jaime,123454500,"67 , Charles Street"

In [13]:
df_cust

,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,FULL_STREET_ADDRESS
0,4210653310061055,Natchez,United States,AHooper@example.com,(516)123-7818,MS,39120,Alec,Hooper,2018-04-21T12:49:02.000-04:00,wm,123456100,"656 , Main Street North"
1,4210653310102868,Wethersfield,United States,EHolman@example.com,(516)123-8933,CT,6109,Etta,Holman,2018-04-21T12:49:02.000-04:00,brendan,123453023,"829 , Redwood Drive"
2,4210653310116272,Huntley,United States,WDunham@example.com,(516)124-3018,IL,60142,Wilber,Dunham,2018-04-21T12:49:02.000-04:00,ezequiel,123454487,"683 , 12th Street East"
3,4210653310195948,NewBerlin,United States,EHardy@example.com,(516)124-3215,WI,53151,Eugenio,Hardy,2018-04-21T12:49:02.000-04:00,trina,123459758,"253 , Country Club Road"
4,4210653310356919,ElPaso,United States,WAyers@example.com,(516)124-2074,TX,79930,Wilfred,Ayers,2018-04-21T12:49:02.000-04:00,may,123454431,"301 , Madison Street"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,4210653399559239,SiouxCity,United States,FCastle@example.com,(516)123-8344,IA,51106,Freida,Castle,2018-04-21T12:49:02.000-04:00,jonah,123451589,"882 , Main Street South"
948,4210653399650358,Summerville,United States,FBlock@example.com,(516)124-0420,SC,29483,Fern,Block,2018-04-21T12:49:02.000-04:00,aron,123457088,"470 , Glenwood Avenue"
949,4210653399732638,Duluth,United States,DPruitt@example.com,(516)123-6149,GA,30096,Dylan,Pruitt,2018-04-21T12:49:02.000-04:00,lucas,123453259,"405 , Country Lane"
950,4210653399859149,Rowlett,United States,EBeatty@example.com,(516)123-6886,TX,75088,Emery,Beatty,2018-04-21T12:49:02.000-04:00,susanna,123454047,"15 , 8th Street"
951,4210653399939240,SanLorenzo,United States,PMullen@example.com,(516)123-7017,CA,94580,Phil,Mullen,2018-04-21T12:49:02.000-04:00,jaime,123454500,"67 , Charles Street"

In [14]:
#converting pandas dataframe back to spark dataframe
dfcustomer=spark.createDataFrame(df_cust) 
dfcustomer.printSchema()
dfcustomer.show()

C:\Spark\python\pyspark\sql\pandas\conversion.py:474: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():
C:\Spark\python\pyspark\sql\pandas\conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

root
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: string (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: long (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: long (nullable = true)
 |-- FULL_STREET_ADDRESS: string (nullable = true)

+----------------+------------+-------------+--------------------+-------------+----------+--------+----------+---------+--------------------+-----------+---------+--------------------+
|  CREDIT_CARD_NO|   CUST_CITY| CUST_COUNTRY|          CUST_EMAIL|   CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|        LAST_UPDATED|MIDDLE_NAME|      SSN| FULL_STREET_ADDRESS|
+----------------+------------+-------------+--------------------+-------------+----------+--------+----------+---------+--------------------+-----------+---------+--------------------+
|4210653310061055|     Natchez|United States| AHooper@example.com|(516)123-7818|        MS|   39120|      Alec|   Hooper|2018-04-21T12:49:...|         wm|123456100|656 , Main Street...|
|4210653310102868|Wethersfield|United States| EHolman@example.com|(516)123-8933|        CT|    6109|      Etta|   Holman|2018-04-21T12:49:...|    brendan|123453023| 829 , Redwood Drive|
|4210653310116272|     Huntley|United States| WDunham@example.com|(516)124-3018|        IL|   60142|    Wilber|   Dunham|2018-04-21T12:49:...|   ezequiel|123454487|683 , 12th Street...|
|4210653310195948|   NewBerlin|United States|  EHardy@example.com|(516)124-3215|        WI|   53151|   Eugenio|    Hardy|2018-04-21T12:49:...|      trina|123459758|253 , Country Clu...|
|4210653310356919|      ElPaso|United States|  WAyers@example.com|(516)124-2074|        TX|   79930|   Wilfred|    Ayers|2018-04-21T12:49:...|        may|123454431|301 , Madison Street|
|4210653310395982|NorthOlmsted|United States|BWoodard@example.com|(516)124-2570|        OH|   44070|      Beau|  Woodard|2018-04-21T12:49:...|    ambrose|123454202|  3 , Colonial Drive|
|4210653310400536|      Vienna|United States|   SKemp@example.com|(516)123-9685|        VA|   22180|    Sheila|     Kemp|2018-04-21T12:49:...|      larry|123451799| 84 , Belmont Avenue|
|4210653310459911|      Duarte|United States| WHurley@example.com|(516)123-8213|        CA|   91010|     Wendy|   Hurley|2018-04-21T12:49:...|        ora|123453875|  728 , Oxford Court|
|4210653310773972|      Owosso|United States|AGilmore@example.com|(516)124-0689|        MI|   48867|      Alec|  Gilmore|2018-04-21T12:49:...|     tracie|123457511|  81 , Forest Street|
|4210653310794854|        Zion|United States|    BLau@example.com|(516)123-5222|        IL|   60099|    Barbra|      Lau|2018-04-21T12:49:...|    mitchel|123457464|  561 , Court Street|
|4210653310817373|  Youngstown|United States|EThomson@example.com|(516)124-1363|        OH|   44512|   Edmundo|  Thomson|2018-04-21T12:49:...|      denny|123457639| 622 , Cypress Court|
|4210653310844617| Summerville|United States| ETruong@example.com|(516)123-6228|        SC|   29483|      Elsa|   Truong|2018-04-21T12:49:...|   isabelle|123453242|924 , 8th Street ...|
|4210653311015303|      ElPaso|United States|HMckinney@example...|(516)123-8165|        TX|   79930|     Homer| Mckinney|2018-04-21T12:49:...|      henry|123454339|   611 , East Avenue|
|4210653311215039|      Fenton|United States|   RKidd@example.com|(516)123-4730|        MI|   48430|      Rita|     Kidd|2018-04-21T12:49:...|     rickey|123454537|      680 , Route 44|
|4210653311229354|  Grandville|United States|ABallard@example.com|(516)124-2113|        MI|   49418|    Amalia|  Ballard|2018-04-21T12:49:...|  heriberto|123452373|  71 , Warren Street|
|4210653311652836|    YubaCity|United States| PThomas@example.com|(516)123-9888|        CA|   95993|     Patty|   Thomas|2018-04-21T12:49:...|   angelita|123455343|  195 , Jones Street|
|4210653311707126|   CapeCoral|United States| JMorrow@example.com|(516)124-0158|        FL|   33904|  Josefina|   Morrow|2018-04-21T12:49:...|   dorothea|123451533|    500 , New Street|
|4210653311730764|  Brookfield|United States|NAndrews@example.com|(516)124-1408|        WI|   53045|    Nelson|  Andrews|2018-04-21T12:49:...|  jefferson|123459278|989 , Division St...|
|4210653311898082|    Richmond|United States|MSchneider@exampl...|(516)123-8390|        VA|   23223|    Miquel|Schneider|2018-04-21T12:49:...|     maximo|123456915|  810 , Maple Street|
|4210653312021765| WestChester|United States|PTidwell@example.com|(516)123-5067|        PA|   19380|    Parker|  Tidwell|2018-04-21T12:49:...|    arnulfo|123453807|    649 , Eagle Road|
+----------------+------------+-------------+--------------------+-------------+----------+--------+----------+---------+--------------------+-----------+---------+--------------------+
only showing top 20 rows

In [15]:
df_cust.to_json('clean_cdw_sapp_customer.json', orient='records')

In [16]:
#read branch.json and loading to spark dataframe
dfbranch= spark.read.json('capstone_files\cdw_sapp_branch.json')
dfbranch.printSchema()
dfbranch.show()
dfbranch.createTempView('branch_table')

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)

+-----------------+-----------+------------+------------+------------+-------------------+----------+--------------------+
|      BRANCH_CITY|BRANCH_CODE| BRANCH_NAME|BRANCH_PHONE|BRANCH_STATE|      BRANCH_STREET|BRANCH_ZIP|        LAST_UPDATED|
+-----------------+-----------+------------+------------+------------+-------------------+----------+--------------------+
|        Lakeville|          1|Example Bank|  1234565276|          MN|       Bridle Court|     55044|2018-04-18T16:51:...|
|          Huntley|          2|Example Bank|  1234618993|          IL|  Washington Street|     60142|2018-04-18T16:51:...|
|SouthRichmondHill|          3|Example Bank|  1234985926|          NY|      Warren Street|     11419|2018-04-18T16:51:...|
|       Middleburg|          4|Example Bank|  1234663064|          FL|   Cleveland Street|     32068|2018-04-18T16:51:...|
|    KingOfPrussia|          5|Example Bank|  1234849701|          PA|        14th Street|     19406|2018-04-18T16:51:...|
|         Paterson|          7|Example Bank|  1234144890|          NJ|   Jefferson Street|      7501|2018-04-18T16:51:...|
|        Pittsford|          8|Example Bank|  1234678272|          NY|           B Street|     14534|2018-04-18T16:51:...|
|     Wethersfield|          9|Example Bank|  1234675219|          CT|    Jefferson Court|      6109|2018-04-18T16:51:...|
|     NorthOlmsted|         10|Example Bank|  1234145047|          OH|     Cambridge Road|     44070|2018-04-18T16:51:...|
|     Hillsborough|         11|Example Bank|  1234366354|          NJ|    3rd Street West|      8844|2018-04-18T16:51:...|
|   MadisonHeights|         12|Example Bank|  1234867175|          MI|          Mill Road|     48071|2018-04-18T16:51:...|
|           Oviedo|         14|Example Bank|  1234938460|          FL|  Washington Street|     32765|2018-04-18T16:51:...|
|    Mechanicsburg|         15|Example Bank|  1234462043|          PA|    Chestnut Street|     17050|2018-04-18T16:51:...|
|        Plainview|         16|Example Bank|  1234857525|          NY|       Monroe Drive|     11803|2018-04-18T16:51:...|
|          Paducah|         17|Example Bank|  1234546360|          KY|    Railroad Street|     42001|2018-04-18T16:51:...|
|     Harleysville|         18|Example Bank|  1234824455|          PA|Church Street South|     19438|2018-04-18T16:51:...|
|     SilverSpring|         19|Example Bank|  1234484380|          MD|        King Street|     20901|2018-04-18T16:51:...|
|       Burnsville|         20|Example Bank|  1234840138|          MN|   Canterbury Drive|     55337|2018-04-18T16:51:...|
|           Tacoma|         21|Example Bank|  1234362433|          WA|         2nd Avenue|     98444|2018-04-18T16:51:...|
|         Carlisle|         22|Example Bank|  1234922492|          PA| Front Street South|     17013|2018-04-18T16:51:...|
+-----------------+-----------+------------+------------+------------+-------------------+----------+--------------------+
only showing top 20 rows

In [17]:
dfbranch.printSchema()

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)

In [18]:
new_dfbranch=dfbranch.withColumn("BRANCH_PHONE2", concat(lit('(') , dfbranch['BRANCH_PHONE'].substr(1,3) , lit(')') , dfbranch['BRANCH_PHONE'].substr(4,3), lit('-'), dfbranch['BRANCH_PHONE'].substr(7,10))) #format phone number and assign it to new df variable

In [19]:
new_dfbranch=new_dfbranch.drop('BRANCH_PHONE')

In [20]:
new_dfbranch=new_dfbranch.withColumnRenamed('BRANCH_PHONE2', 'BRANCH_PHONE') #rename column and assign it to new df variable

In [21]:
new_dfbranch.show()

+-----------------+-----------+------------+------------+-------------------+----------+--------------------+-------------+
|      BRANCH_CITY|BRANCH_CODE| BRANCH_NAME|BRANCH_STATE|      BRANCH_STREET|BRANCH_ZIP|        LAST_UPDATED| BRANCH_PHONE|
+-----------------+-----------+------------+------------+-------------------+----------+--------------------+-------------+
|        Lakeville|          1|Example Bank|          MN|       Bridle Court|     55044|2018-04-18T16:51:...|(123)456-5276|
|          Huntley|          2|Example Bank|          IL|  Washington Street|     60142|2018-04-18T16:51:...|(123)461-8993|
|SouthRichmondHill|          3|Example Bank|          NY|      Warren Street|     11419|2018-04-18T16:51:...|(123)498-5926|
|       Middleburg|          4|Example Bank|          FL|   Cleveland Street|     32068|2018-04-18T16:51:...|(123)466-3064|
|    KingOfPrussia|          5|Example Bank|          PA|        14th Street|     19406|2018-04-18T16:51:...|(123)484-9701|
|         Paterson|          7|Example Bank|          NJ|   Jefferson Street|      7501|2018-04-18T16:51:...|(123)414-4890|
|        Pittsford|          8|Example Bank|          NY|           B Street|     14534|2018-04-18T16:51:...|(123)467-8272|
|     Wethersfield|          9|Example Bank|          CT|    Jefferson Court|      6109|2018-04-18T16:51:...|(123)467-5219|
|     NorthOlmsted|         10|Example Bank|          OH|     Cambridge Road|     44070|2018-04-18T16:51:...|(123)414-5047|
|     Hillsborough|         11|Example Bank|          NJ|    3rd Street West|      8844|2018-04-18T16:51:...|(123)436-6354|
|   MadisonHeights|         12|Example Bank|          MI|          Mill Road|     48071|2018-04-18T16:51:...|(123)486-7175|
|           Oviedo|         14|Example Bank|          FL|  Washington Street|     32765|2018-04-18T16:51:...|(123)493-8460|
|    Mechanicsburg|         15|Example Bank|          PA|    Chestnut Street|     17050|2018-04-18T16:51:...|(123)446-2043|
|        Plainview|         16|Example Bank|          NY|       Monroe Drive|     11803|2018-04-18T16:51:...|(123)485-7525|
|          Paducah|         17|Example Bank|          KY|    Railroad Street|     42001|2018-04-18T16:51:...|(123)454-6360|
|     Harleysville|         18|Example Bank|          PA|Church Street South|     19438|2018-04-18T16:51:...|(123)482-4455|
|     SilverSpring|         19|Example Bank|          MD|        King Street|     20901|2018-04-18T16:51:...|(123)448-4380|
|       Burnsville|         20|Example Bank|          MN|   Canterbury Drive|     55337|2018-04-18T16:51:...|(123)484-0138|
|           Tacoma|         21|Example Bank|          WA|         2nd Avenue|     98444|2018-04-18T16:51:...|(123)436-2433|
|         Carlisle|         22|Example Bank|          PA| Front Street South|     17013|2018-04-18T16:51:...|(123)492-2492|
+-----------------+-----------+------------+------------+-------------------+----------+--------------------+-------------+
only showing top 20 rows

In [22]:
new_dfbranch.withColumn('BRANCH_ZIP', when(new_dfbranch.BRANCH_ZIP.isNull(), '00000').otherwise(new_dfbranch.BRANCH_ZIP)).show() #if source value is null set default to (00000)

+-----------------+-----------+------------+------------+-------------------+----------+--------------------+-------------+
|      BRANCH_CITY|BRANCH_CODE| BRANCH_NAME|BRANCH_STATE|      BRANCH_STREET|BRANCH_ZIP|        LAST_UPDATED| BRANCH_PHONE|
+-----------------+-----------+------------+------------+-------------------+----------+--------------------+-------------+
|        Lakeville|          1|Example Bank|          MN|       Bridle Court|     55044|2018-04-18T16:51:...|(123)456-5276|
|          Huntley|          2|Example Bank|          IL|  Washington Street|     60142|2018-04-18T16:51:...|(123)461-8993|
|SouthRichmondHill|          3|Example Bank|          NY|      Warren Street|     11419|2018-04-18T16:51:...|(123)498-5926|
|       Middleburg|          4|Example Bank|          FL|   Cleveland Street|     32068|2018-04-18T16:51:...|(123)466-3064|
|    KingOfPrussia|          5|Example Bank|          PA|        14th Street|     19406|2018-04-18T16:51:...|(123)484-9701|
|         Paterson|          7|Example Bank|          NJ|   Jefferson Street|      7501|2018-04-18T16:51:...|(123)414-4890|
|        Pittsford|          8|Example Bank|          NY|           B Street|     14534|2018-04-18T16:51:...|(123)467-8272|
|     Wethersfield|          9|Example Bank|          CT|    Jefferson Court|      6109|2018-04-18T16:51:...|(123)467-5219|
|     NorthOlmsted|         10|Example Bank|          OH|     Cambridge Road|     44070|2018-04-18T16:51:...|(123)414-5047|
|     Hillsborough|         11|Example Bank|          NJ|    3rd Street West|      8844|2018-04-18T16:51:...|(123)436-6354|
|   MadisonHeights|         12|Example Bank|          MI|          Mill Road|     48071|2018-04-18T16:51:...|(123)486-7175|
|           Oviedo|         14|Example Bank|          FL|  Washington Street|     32765|2018-04-18T16:51:...|(123)493-8460|
|    Mechanicsburg|         15|Example Bank|          PA|    Chestnut Street|     17050|2018-04-18T16:51:...|(123)446-2043|
|        Plainview|         16|Example Bank|          NY|       Monroe Drive|     11803|2018-04-18T16:51:...|(123)485-7525|
|          Paducah|         17|Example Bank|          KY|    Railroad Street|     42001|2018-04-18T16:51:...|(123)454-6360|
|     Harleysville|         18|Example Bank|          PA|Church Street South|     19438|2018-04-18T16:51:...|(123)482-4455|
|     SilverSpring|         19|Example Bank|          MD|        King Street|     20901|2018-04-18T16:51:...|(123)448-4380|
|       Burnsville|         20|Example Bank|          MN|   Canterbury Drive|     55337|2018-04-18T16:51:...|(123)484-0138|
|           Tacoma|         21|Example Bank|          WA|         2nd Avenue|     98444|2018-04-18T16:51:...|(123)436-2433|
|         Carlisle|         22|Example Bank|          PA| Front Street South|     17013|2018-04-18T16:51:...|(123)492-2492|
+-----------------+-----------+------------+------------+-------------------+----------+--------------------+-------------+
only showing top 20 rows

In [23]:
df_branch=new_dfbranch.toPandas()
df_branch.to_json('cleaned_cdw_sapp_branch.json',orient='records')

In [24]:
dfcredit= spark.read.json('capstone_files\cdw_sapp_credit.json')
dfcredit.printSchema()
dfcredit.show()

root
 |-- BRANCH_CODE: long (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_SSN: long (nullable = true)
 |-- DAY: long (nullable = true)
 |-- MONTH: long (nullable = true)
 |-- TRANSACTION_ID: long (nullable = true)
 |-- TRANSACTION_TYPE: string (nullable = true)
 |-- TRANSACTION_VALUE: double (nullable = true)
 |-- YEAR: long (nullable = true)

+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|BRANCH_CODE|  CREDIT_CARD_NO| CUST_SSN|DAY|MONTH|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|YEAR|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|        114|4210653349028689|123459988| 14|    2|             1|       Education|             78.9|2018|
|         35|4210653349028689|123459988| 20|    3|             2|   Entertainment|            14.24|2018|
|        160|4210653349028689|123459988|  8|    7|             3|         Grocery|             56.7|2018|
|        114|4210653349028689|123459988| 19|    4|             4|   Entertainment|            59.73|2018|
|         93|4210653349028689|123459988| 10|   10|             5|             Gas|             3.59|2018|
|        164|4210653349028689|123459988| 28|    5|             6|       Education|             6.89|2018|
|        119|4210653349028689|123459988| 19|    5|             7|   Entertainment|            43.39|2018|
|         23|4210653349028689|123459988|  8|    8|             8|             Gas|            95.39|2018|
|        166|4210653349028689|123459988| 18|    3|             9|   Entertainment|            93.26|2018|
|         83|4210653349028689|123459988|  3|    9|            10|           Bills|           100.38|2018|
|         52|4210653349028689|123459988| 21|    8|            11|             Gas|            98.75|2018|
|         17|4210653349028689|123459988| 24|   12|            12|             Gas|            42.71|2018|
|         80|4210653349028689|123459988|  3|    4|            13|         Grocery|            40.24|2018|
|         50|4210653349028689|123459988| 15|    4|            14|           Bills|            17.81|2018|
|        123|4210653349028689|123459988| 17|    5|            15|           Bills|             29.0|2018|
|          9|4210653349028689|123459988|  6|    7|            16|            Test|            70.63|2018|
|          3|4210653349028689|123459988| 28|    9|            17|            Test|            27.04|2018|
|        135|4210653349028689|123459988|  4|    7|            18|   Entertainment|            88.75|2018|
|        103|4210653349028689|123459988| 24|    4|            19|            Test|            77.02|2018|
|         78|4210653349028689|123459988|  8|   10|            20|           Bills|            34.34|2018|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
only showing top 20 rows

In [25]:
df_credit=dfcredit.toPandas()

In [26]:
df_credit['DAY']=df_credit['DAY'].astype(str)
df_credit['MONTH']=df_credit['MONTH'].astype(str)
df_credit['YEAR']=df_credit['YEAR'].astype(str)

In [27]:
df_credit.dtypes

BRANCH_CODE            int64
CREDIT_CARD_NO        object
CUST_SSN               int64
DAY                   object
MONTH                 object
TRANSACTION_ID         int64
TRANSACTION_TYPE      object
TRANSACTION_VALUE    float64
YEAR                  object
dtype: object

In [28]:
date= df_credit['DAY']


for day in df_credit['DAY']:  #convert D to DD
    if len(day) < 2:
        df_credit['DAY']= date.str.rjust(2,'0')


month=df_credit['MONTH']

for months in df_credit['MONTH']: #convert M to MM
    if len(months) < 2:
        df_credit['MONTH']= month.str.rjust(2,'0')


df_credit

,BRANCH_CODE,CREDIT_CARD_NO,CUST_SSN,DAY,MONTH,TRANSACTION_ID,TRANSACTION_TYPE,TRANSACTION_VALUE,YEAR
0,114,4210653349028689,123459988,14,02,1,Education,78.90,2018
1,35,4210653349028689,123459988,20,03,2,Entertainment,14.24,2018
2,160,4210653349028689,123459988,08,07,3,Grocery,56.70,2018
3,114,4210653349028689,123459988,19,04,4,Entertainment,59.73,2018
4,93,4210653349028689,123459988,10,10,5,Gas,3.59,2018
...,...,...,...,...,...,...,...,...,...
46689,49,4210653344660822,123451007,12,09,46690,Gas,66.20,2018
46690,168,4210653344660822,123451007,05,02,46691,Grocery,100.13,2018
46691,104,4210653344660822,123451007,16,12,46692,Test,35.83,2018
46692,32,4210653344660822,123451007,15,01,46693,Entertainment,90.99,2018
46693,45,4210653344660822,123451007,17,11,46694,Healthcare,82.29,2018

In [29]:
df_credit['TIMEID']=df_credit[['YEAR','MONTH','DAY']].apply(''.join, axis=1)

In [30]:
df_credit.drop(['DAY', 'MONTH', 'YEAR'], axis=1, inplace=True)
df_credit

,BRANCH_CODE,CREDIT_CARD_NO,CUST_SSN,TRANSACTION_ID,TRANSACTION_TYPE,TRANSACTION_VALUE,TIMEID
0,114,4210653349028689,123459988,1,Education,78.90,20180214
1,35,4210653349028689,123459988,2,Entertainment,14.24,20180320
2,160,4210653349028689,123459988,3,Grocery,56.70,20180708
3,114,4210653349028689,123459988,4,Entertainment,59.73,20180419
4,93,4210653349028689,123459988,5,Gas,3.59,20181010
...,...,...,...,...,...,...,...
46689,49,4210653344660822,123451007,46690,Gas,66.20,20180912
46690,168,4210653344660822,123451007,46691,Grocery,100.13,20180205
46691,104,4210653344660822,123451007,46692,Test,35.83,20181216
46692,32,4210653344660822,123451007,46693,Entertainment,90.99,20180115
46693,45,4210653344660822,123451007,46694,Healthcare,82.29,20181117

In [31]:
df_credit.to_json('cleaned_cdw_sapp_credit.json',orient='records')

In [32]:
#converting pandas dataframe back to spark dataframe
dfcredit=spark.createDataFrame(df_credit) 
dfcredit.printSchema()
dfcredit.show()

C:\Spark\python\pyspark\sql\pandas\conversion.py:474: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():
C:\Spark\python\pyspark\sql\pandas\conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

root
 |-- BRANCH_CODE: long (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_SSN: long (nullable = true)
 |-- TRANSACTION_ID: long (nullable = true)
 |-- TRANSACTION_TYPE: string (nullable = true)
 |-- TRANSACTION_VALUE: double (nullable = true)
 |-- TIMEID: string (nullable = true)

+-----------+----------------+---------+--------------+----------------+-----------------+--------+
|BRANCH_CODE|  CREDIT_CARD_NO| CUST_SSN|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|  TIMEID|
+-----------+----------------+---------+--------------+----------------+-----------------+--------+
|        114|4210653349028689|123459988|             1|       Education|             78.9|20180214|
|         35|4210653349028689|123459988|             2|   Entertainment|            14.24|20180320|
|        160|4210653349028689|123459988|             3|         Grocery|             56.7|20180708|
|        114|4210653349028689|123459988|             4|   Entertainment|            59.73|20180419|
|         93|4210653349028689|123459988|             5|             Gas|             3.59|20181010|
|        164|4210653349028689|123459988|             6|       Education|             6.89|20180528|
|        119|4210653349028689|123459988|             7|   Entertainment|            43.39|20180519|
|         23|4210653349028689|123459988|             8|             Gas|            95.39|20180808|
|        166|4210653349028689|123459988|             9|   Entertainment|            93.26|20180318|
|         83|4210653349028689|123459988|            10|           Bills|           100.38|20180903|
|         52|4210653349028689|123459988|            11|             Gas|            98.75|20180821|
|         17|4210653349028689|123459988|            12|             Gas|            42.71|20181224|
|         80|4210653349028689|123459988|            13|         Grocery|            40.24|20180403|
|         50|4210653349028689|123459988|            14|           Bills|            17.81|20180415|
|        123|4210653349028689|123459988|            15|           Bills|             29.0|20180517|
|          9|4210653349028689|123459988|            16|            Test|            70.63|20180706|
|          3|4210653349028689|123459988|            17|            Test|            27.04|20180928|
|        135|4210653349028689|123459988|            18|   Entertainment|            88.75|20180704|
|        103|4210653349028689|123459988|            19|            Test|            77.02|20180424|
|         78|4210653349028689|123459988|            20|           Bills|            34.34|20181008|
+-----------+----------------+---------+--------------+----------------+-----------------+--------+
only showing top 20 rows

In [33]:
import configparser

config = configparser.ConfigParser()
with open('config.ini', 'w') as configfile:
   config.write(configfile)

#config.read('config.ini')

#host = config['DATABASE']['host']
#user = config['DATABASE']['user']
#password = config['DATABASE']['Pass1234']
#database = config['DATABASE']['database']

In [34]:
new_dfbranch.write.format("jdbc") \
  .mode("append") \
  .option("url", "jdbc:mysql://localhost:3306/creditcard_capstone") \
  .option("dbtable", "cdw_sapp_branch") \
  .option("user", "root") \
  .option("password", 'Pass1234') \
  .save()

In [35]:
dfcredit.write.format("jdbc") \
  .mode("append") \
  .option("url", "jdbc:mysql://localhost:3306/creditcard_capstone") \
  .option("dbtable", "cdw_sapp_credit_card") \
  .option("user", "root") \
  .option("password", "Pass1234") \
  .save()

In [36]:
dfcustomer.write.format("jdbc") \
  .mode("append") \
  .option("url", "jdbc:mysql://localhost:3306/creditcard_capstone") \
  .option("dbtable", "cdw_sapp_customer") \
  .option("user", "root") \
  .option("password", "Pass1234") \
  .save()

In [45]:
creditdf = spark.read.json('cleaned_cdw_sapp_credit.json')
creditdf.printSchema()

custdf = spark.read.json('clean_cdw_sapp_customer.json')
custdf.printSchema()

branchdf= spark.read.json('cleaned_cdw_sapp_branch.json')
branchdf.printSchema()

#creditdf.createTempView("credit_table")
#custdf.createTempView("customer_table")
branchdf.createTempView("branches_table")

root
 |-- BRANCH_CODE: long (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_SSN: long (nullable = true)
 |-- TIMEID: string (nullable = true)
 |-- TRANSACTION_ID: long (nullable = true)
 |-- TRANSACTION_TYPE: string (nullable = true)
 |-- TRANSACTION_VALUE: double (nullable = true)

root
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: string (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: long (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- FULL_STREET_ADDRESS: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: long (nullable = true)

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)

In [40]:
dfcust_credit =spark.sql("SELECT customer_table.CUST_ZIP, customer_table.CUST_STATE, credit_table.BRANCH_CODE, credit_table.CREDIT_CARD_NO, credit_table.CUST_SSN, credit_table.TIMEID, \
credit_table.TRANSACTION_ID, credit_table.TRANSACTION_TYPE, credit_table.TRANSACTION_VALUE FROM customer_table \
left join credit_table ON customer_table.CREDIT_CARD_NO = credit_table.CREDIT_CARD_NO")

In [46]:
#join customer and credit table 
dfbranch_credit =spark.sql("SELECT branches_table.BRANCH_STATE, credit_table.BRANCH_CODE, credit_table.CREDIT_CARD_NO, credit_table.CUST_SSN, credit_table.TIMEID, \
credit_table.TRANSACTION_ID, credit_table.TRANSACTION_TYPE, credit_table.TRANSACTION_VALUE FROM branches_table \
left join credit_table ON branches_table.BRANCH_CODE = credit_table.BRANCH_CODE")

In [47]:
newdfcust_credit=dfcust_credit.toPandas() #convert to pandas

In [48]:
newdfbranch_credit=dfbranch_credit.toPandas()

In [49]:
newdfcust_credit.to_json('cleaned_cdw_sapp_credit_customer.json',orient='records') #save to json file

In [50]:
newdfbranch_credit.to_json('cleaned_cdw_sapp_branch_credit.json', orient='records')

# Transaction Detail Module

In [52]:
#6511
#month 11
def display_transactions_given_zip_month_year():
    import json
    new_credit=open('cleaned_cdw_sapp_credit_customer.json') #open json
    transactions= json.load(new_credit) 

    zip_code = int(input("Enter zip code: "))
    month = input("Enter month (1-12): ")
    year = input("Enter year (YYYY): ")
    transactions_by_zip_month_year = []
    for transaction in transactions:
        if transaction['CUST_ZIP']== zip_code and transaction['TIMEID'][4:6] == month and transaction['TIMEID'][:4] == year:
            transactions_by_zip_month_year.append(transaction)
    sorted_transactions = sorted(transactions_by_zip_month_year, key=lambda x: x["TIMEID"][6:8], reverse=True)
    if len(sorted_transactions) == 0:
        print("No transactions found for the given zip code and month/year.")
    else:
        print(sorted_transactions)
#display_transactions_given_zip_month_year()

In [53]:
def display_transaction_num_and_total_value_given_type():
    import json
    from functools import reduce
    credit=open('cleaned_cdw_sapp_credit.json') #open json
    transactions= json.load(credit)

    transaction_type= input('Type Transaction Type:').upper
    transactions_by_type=[]

    for transaction in transactions:
        if transaction['TRANSACTION_TYPE'] == transaction_type:
            transactions_by_type.append(transaction)
    transaction_values= [value.get('TRANSACTION_VALUE', None) for value in transactions_by_type]
    sum_values= reduce(lambda x, y:x+y,transaction_values)
    if len(transactions_by_type) == 0:
       print('No transactions found for given transaction type')
    else:
       print('Number of transactions:', len(transactions_by_type), 'Total transaction value:', sum_values)
#display_transaction_num_and_total_value_given_type()

In [65]:
def display_transaction_num_and_total_value_given_state():
    import json
    from functools import reduce
    branch=open('cleaned_cdw_sapp_branch_credit.json') #open json
    transactions= json.load(branch) #load json into list
    state= input("Type State as 2 characters:").upper()
    transactions_by_state= []

    for transaction in transactions:
        if transaction['BRANCH_STATE'] == state:
            transactions_by_state.append(transaction)
    transaction_values= [value.get('TRANSACTION_VALUE', None) for value in transactions_by_state]
    sum_values= reduce(lambda x, y:x+y,transaction_values)
    if len(transactions_by_state) == 0:
       print('No transactions found for given transaction type')
    else:
       print('Number of transactions:', len(transactions_by_state), 'Total transaction value:', sum_values)

display_transaction_num_and_total_value_given_state()

Number of transactions: 1739 Total transaction value: 88323.99000000008

# Customer Details Module

In [72]:
def check_account_details():
    import json 
    cust=open('clean_cdw_sapp_customer.json') #open json
    customers= json.load(cust) #load json into 

    customer_firstname= input("Enter Customer's First Name:")
    customer_lastname= input("Enter Customer's Last Name:")
    for customer in customers:
        if customer['FIRST_NAME'] == customer_firstname and customer['LAST_NAME'] == customer_lastname:
            print('Customer Name:', customer['FIRST_NAME'], customer['LAST_NAME'])
            print('Customer Phone Number:', customer['CUST_PHONE'])
            print('Customer Email Address:', customer['CUST_EMAIL'])
            print('Credit Card Number:',customer['CREDIT_CARD_NO'])
            print('Customer Country:', customer['CUST_COUNTRY'])
            print('Customer Address:', customer['FULL_STREET_ADDRESS'], customer['CUST_CITY'], customer['CUST_STATE'], customer['CUST_ZIP'])
            print('Customer Social Security Number:', customer['SSN'])
    else:
        print("Customer's Name not found in our records")
            
check_account_details()

Customer Name: Kermit Walker
Customer Phone Number: (516)124-0375
Customer Email Address: KWalker@example.com
Credit Card Number: 4210653320826184
Customer Country: United States
Customer Address: 710 , Route 10 Jonesboro GA 30236
Customer Social Security Number: 123456102
Customer's Name not found in our records